app/controllers/projects_controller.rb

  def create
    @project = Project.new(project_params)
    @project.users << current_user
---
INSERT INTO "projects" ("title", "details", "expected_completion_date", "tenant_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"

    def set_tenant
      @tenant = Tenant.find(params[:tenant_id])
---
SELECT  "tenants".* FROM "tenants" WHERE (tenants.tenant_id IS NULL) AND "tenants"."id" = $1 LIMIT 1  [["id", 2]]